// Створіть масив styles з елементами 'Джаз' і 'Блюз'
//Додайте в кінець 'Рок-н-ролл'
//Заменіть значення 'Блюз' на 'Класика'
//Видаліть перший елемент масива та виведіть його в консоль
// Додайте 'Реп' та 'Реггі' на початок списку.
const styles = ['Джаз', 'Блюз'];
styles.push('Рок-н-ролл');

// styles[1] = 'Класика';

 let idex = styles.indexOf('Блюз');
// styles[idex] = 'Класика';

styles.splice(idex, 1, 'Класика');
console.log(styles.shift());
styles.unshift('Реп', 'Реггі');
console.log(styles);